#+TITLE:     2D Arrays
#+AUTHOR:    Thomas Hausberger, Matthias Panny @@latex:\\@@ Ursprünglich erstellt von Sebastian Stabinger
#+DATE:      SS2022

*** Beispiel
#+BEGIN_SRC C
  #include <stdio.h>

  int main() {
    int a[3][4] = {{1, 2, 3, 4}, {5, 6, 7, 8}, {9, 10, 11, 12}};

    for (int row = 0; row < 3; row++) {
      for (int col = 0; col < 4; col++)
        printf("%d\t", a[row][col]);
      printf("\n");
    }
  }
#+END_SRC

#+RESULTS:
| 1 |  2 |  3 |  4 |
| 5 |  6 |  7 |  8 |
| 9 | 10 | 11 | 12 |

*** Beispiel
#+BEGIN_SRC C
  #include <stdio.h>

  void print_matrix(int arr[][4], int rows) {
    for (int row = 0; row < rows; row++) {
      for (int col = 0; col < 4; col++)
        printf("%d\t", arr[row][col]);
      printf("\n");
    }
  }

  int main() {
    int a[3][4] = {{1, 2, 3, 4}, {5, 6, 7, 8}, {9, 10, 11, 12}};
    print_matrix(a, 3);
  }
#+END_SRC

#+RESULTS:
| 1 |  2 |  3 |  4 |
| 5 |  6 |  7 |  8 |
| 9 | 10 | 11 | 12 |

*** Beispiel
#+BEGIN_SRC C
  #include <stdio.h>

  void print_matrix(int rows, int cols, int arr[][cols]) {
    for (int row = 0; row < rows; row++) {
      for (int col = 0; col < cols; col++)
        printf("%d\t", arr[row][col]);
      printf("\n");
    }
  }

  int main() {
    int a[3][4] = {{1, 2, 3, 4}, {5, 6, 7, 8}, {9, 10, 11, 12}};
    print_matrix(3, 4, a);
  }
#+END_SRC

#+RESULTS:
| 1 |  2 |  3 |  4 |
| 5 |  6 |  7 |  8 |
| 9 | 10 | 11 | 12 |

*** Beispiel
#+BEGIN_SRC C
  #include <stdio.h>

  int main() {
    int rows = 3;
    int cols = 4;
    int a[12] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12};

    for (int row = 0; row < 3; row++) {
      for (int col = 0; col < 4; col++)
        printf("%d\t", a[row * cols + col]);
      printf("\n");
    }
  }
#+END_SRC

#+RESULTS:
| 1 |  2 |  3 |  4 |
| 5 |  6 |  7 |  8 |
| 9 | 10 | 11 | 12 |
*** Beispiel
#+BEGIN_SRC C
  #include <stdio.h>

  void print_matrix(int *arr, int rows, int cols) {
    for (int row = 0; row < rows; row++) {
      for (int col = 0; col < cols; col++)
        printf("%d\t", arr[row * cols + col]);
      printf("\n");
    }
  }

  int main() {
    int a[3][4] = {{1, 2, 3, 4}, {5, 6, 7, 8}, {9, 10, 11, 12}};
    print_matrix(a, 3, 4);
  }
#+END_SRC

#+RESULTS:
| 1 |  2 |  3 |  4 |
| 5 |  6 |  7 |  8 |
| 9 | 10 | 11 | 12 |

